cvl_api.log

2026-02-05 17:15:13,300 - PAN CHECK: ABCDE1234F | RESULT: <Element APP_RES_ROOT at 0x7f7fc7d58ac0>
2026-02-05 18:05:59,627 - PAN CHECK: ABCDE1234F | RESULT: <Element APP_RES_ROOT at 0x7f6aac9df340>
2026-02-05 19:07:51,143 - CVL REQUEST XML:
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <wsa:Action>https://pancheck.www.kracvl.com/ICVLPanInquiry/GetPassword</wsa:Action>
    <wsa:MessageID>urn:uuid:256e444a-79e5-4cf2-86fa-22c37a34782e</wsa:MessageID>
    <wsa:To>https://pancheck.www.kracvl.com/CVLPanInquiry.svc</wsa:To>
  </soap-env:Header>
  <soap-env:Body>
    <ns0:GetPassword xmlns:ns0="https://pancheck.www.kracvl.com">
      <ns0:webApi>
        <ns0:userName>WEBADMIN</ns0:userName>
        <ns0:posCode>5100147231</ns0:posCode>
        <ns0:password>********</ns0:password>
        <ns0:passKey>********</ns0:passKey>
      </ns0:webApi>
    </ns0:GetPassword>
  </soap-env:Body>
</soap-env:Envelope>

2026-02-05 19:07:51,187 - CVL RESPONSE XML:
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <GetPasswordResponse xmlns="https://pancheck.www.kracvl.com">
      <GetPasswordResult>********</GetPasswordResult>
    </GetPasswordResponse>
  </s:Body>
</s:Envelope>

2026-02-05 19:07:51,188 - CVL REQUEST XML:
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <wsa:Action>https://pancheck.www.kracvl.com/ICVLPanInquiry/GetPanStatus</wsa:Action>
    <wsa:MessageID>urn:uuid:932ffb43-e750-4ad2-a890-7c90696c86dd</wsa:MessageID>
    <wsa:To>https://pancheck.www.kracvl.com/CVLPanInquiry.svc</wsa:To>
  </soap-env:Header>
  <soap-env:Body>
    <ns0:GetPanStatus xmlns:ns0="https://pancheck.www.kracvl.com">
      <ns0:webApi>
        <ns0:pan>DZKPP0598E</ns0:pan>
        <ns0:userName>WEBADMIN</ns0:userName>
        <ns0:posCode>5100147231</ns0:posCode>
        <ns0:password>********</ns0:password>
        <ns0:passKey>********</ns0:passKey>
      </ns0:webApi>
    </ns0:GetPanStatus>
  </soap-env:Body>
</soap-env:Envelope>

2026-02-05 19:07:51,270 - CVL RESPONSE XML:
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <GetPanStatusResponse xmlns="https://pancheck.www.kracvl.com">
      <GetPanStatusResult>
        <APP_RES_ROOT xmlns="">
          <APP_PAN_INQ>
            <ERROR>
              <ERROR_CODE>WEBERR-029</ERROR_CODE>
              <ERROR_MSG>INVALID IP ADDRESS</ERROR_MSG>
            </ERROR>
          </APP_PAN_INQ>
        </APP_RES_ROOT>
      </GetPanStatusResult>
    </GetPanStatusResponse>
  </s:Body>
</s:Envelope>

2026-02-05 19:07:51,270 - PAN CHECK: DZKPP0598E | RESULT: <Element APP_RES_ROOT at 0x10ad02bc0>
